Repository: KKshitiz/flutter-DDD-template
Catalog: assets/translations/app_*.arb
Languages: es

source: This field is required
es: Este espacio es requerido

source: Please enter an email address
es: Por favor, ingresa tu correo electrónico

source: Please enter a valid email address
es: Por favor, ingresa un correo electrónico valido

source: This field cannot exceed 100 characters
es: Este espacio no puede exceder los 100 carácteres

source: Please enter a phone number
es: Por favor, ingresa tu número de teléfono

source: Please enter a valid phone number
es: Por favor, ingresa un número de teléfono valido

source: Please enter a password
es: Por favor, ingresa una contraseña

# passwordTooShort
source: Password too short. Please enter a password of atleast 6 length
es: Contraseña muy corta. Por favor, ingresa una contraseña con al menos 6 carácteres

# dontForgetYourName
source: Donâ€™t forget your name!
es: ¡No te olvides de tu nombre!

# invalidName
source: Invalid Name. Only alphabets allowed.
es: Nombre invalido. Solo se permiten letras.

source: Please enter an amount
es: Por favor, ingresa un monto

# pleaseEnterValidAmount
source: Please enter a valid amount
es: Por favor, ingresa un monto valido

# pleaseEnterValidDecimal
source: Please enter a valid decimal value
es: Introduce un número decimal valido

# maximumAmountCannotExceed
source: Maximum amount cannot exceed 100,000
es: El monto máximo no puede ser mayor a 100,000

# validIntegerValue
source: Please enter a valid integer value
es: Introduce un valor entero valido

# validTaxRate
source: Please enter a valid rate
es: Por favor, ingresa una tarifa valida

# rateShouldBeInRange
source: The rate should be in range 0-100
es: La tarifa debe estar en un rango de 0-100

# enterAValidPostalCode
source: Please enter a valid postal code
es: Introduce un código postal valido
